-- create
CREATE TABLE classmates (
	id INTEGER PRIMARY KEY AUTO_INCREMENT,
	name TEXT NOT NULL,
	age TINYINT NOT NULL,
	address TEXT NOT NULL
);

-- insert
INSERT INTO classmates (name, age, address)
VALUES
	('Степан Сергеев',	42, 'Волжский, ул. Химиков, 1'),
	('Анна Андрианова',	38, 'Сургут, ул. Мира, 9'),
	('Евгения Шубина',	28,	'Санкт-Петербург, пр. Мечникова, 14'),
	('Леонид Петров',	18,	'Владивосток, ул. Трудовой Славы, 42'),
	('Егор Панов',		44, 'Москва, Парковая 7-я ул., 15'),
	('София Царева',	36, 'Москва, ул. Молостовых, 8'),
	('Эмма Новикова',	30,	'Иркутск, ул. Сибирских Партизан, 11'),
	('Иван Попов',		29, 'Москва, Ташкентсткая ул., 23'),
	('Вероника Гурова',	34,	'Нижний Тагил, Восточная ул., 24'),
	('Анна Царева',		52, 'Тюмень, ул. Шиллера, 22');

-- fetch 
SELECT name FROM classmates
	WHERE age >= 18 AND age < 30
	AND address LIKE 'Москва%';
